ush/TexanRevolt.tex
% Created 2021-09-29 Wed 09:16
% Intended LaTeX compiler: pdflatex
\documentclass{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[dvipsnames]{xcolor}
\usepackage[colorlinks=true, linkcolor=Blue, citecolor=BrickRed, urlcolor=PineGreen]{hyperref}
\usepackage{indentfirst}
\setmainfont[Ligatures=TeX]{Alegreya}
\setmonofont[Ligatures=TeX]{Liga SFMono Nerd Font}
% features: (acronym par-sep)
\newcommand{\acr}[1]{\protect\textls*[110]{\scshape #1}}
\newcommand{\acrs}{\protect\scalebox{.91}[.84]\hspace{0.15ex}s}
\setlength{\parskip}{\baselineskip}
\setlength{\parindent}{0pt}

% end features

%% make document follow Emacs theme

\definecolor{obg}{HTML}{fafafa}
\definecolor{ofg}{HTML}{383a42}

\pagecolor{obg}
\color{ofg}

% list labels

\definecolor{itemlabel}{HTML}{4078f2}

\renewcommand{\labelitemi}{\textcolor{itemlabel}{\textbullet}}
\renewcommand{\labelitemii}{\textcolor{itemlabel}{\normalfont\bfseries \textendash}}
\renewcommand{\labelitemiii}{\textcolor{itemlabel}{\textasteriskcentered}}
\renewcommand{\labelitemiv}{\textcolor{itemlabel}{\textperiodcentered}}

\renewcommand{\labelenumi}{\textcolor{itemlabel}{\theenumi.}}
\renewcommand{\labelenumii}{\textcolor{itemlabel}{(\theenumii)}}
\renewcommand{\labelenumiii}{\textcolor{itemlabel}{\theenumiii.}}
\renewcommand{\labelenumiv}{\textcolor{itemlabel}{\theenumiv.}}

% structural elements

\definecolor{documentTitle}{HTML}{a626a4}
\definecolor{documentInfo}{HTML}{a626a4}
\definecolor{level1}{HTML}{e45649}
\definecolor{level2}{HTML}{da8548}
\definecolor{level3}{HTML}{b751b6}
\definecolor{level4}{HTML}{6f99f5}
\definecolor{level5}{HTML}{bc5cba}
\definecolor{level6}{HTML}{9fbbf8}
\definecolor{level7}{HTML}{d292d1}
\definecolor{level8}{HTML}{d8e4fc}

\addtokomafont{title}{\color{documentTitle}}
\addtokomafont{author}{\color{documentInfo}}
\addtokomafont{date}{\color{documentInfo}}
\addtokomafont{section}{\color{level1}}
\newkomafont{sectionprefix}{\color{level1}}
\addtokomafont{subsection}{\color{level2}}
\newkomafont{subsectionprefix}{\color{level2}}
\addtokomafont{subsubsection}{\color{level3}}
\newkomafont{subsubsectionprefix}{\color{level3}}
\addtokomafont{paragraph}{\color{level4}}
\newkomafont{paragraphprefix}{\color{level4}}
\addtokomafont{subparagraph}{\color{level5}}
\newkomafont{subparagraphprefix}{\color{level5}}

% textual elements

\definecolor{link}{HTML}{4078f2}
\definecolor{cite}{HTML}{4aa8b0}
\definecolor{itemlabel}{HTML}{4078f2}
\definecolor{code}{HTML}{da8548}
\definecolor{verbatim}{HTML}{50a14f}

\renewcommand{\labelitemi}{\textcolor{itemlabel}{\textbullet}}
\renewcommand{\labelitemii}{\textcolor{itemlabel}{\normalfont\bfseries \textendash}}
\renewcommand{\labelitemiii}{\textcolor{itemlabel}{\textasteriskcentered}}
\renewcommand{\labelitemiv}{\textcolor{itemlabel}{\textperiodcentered}}

\renewcommand{\labelenumi}{\textcolor{itemlabel}{\theenumi.}}
\renewcommand{\labelenumii}{\textcolor{itemlabel}{(\theenumii)}}
\renewcommand{\labelenumiii}{\textcolor{itemlabel}{\theenumiii.}}
\renewcommand{\labelenumiv}{\textcolor{itemlabel}{\theenumiv.}}

\DeclareTextFontCommand{\texttt}{\color{code}\ttfamily}
\makeatletter
\def\verbatim@font{\color{verbatim}\normalfont\ttfamily}
\makeatother

% code blocks

\definecolor{codebackground}{HTML}{f6f6f6}
\colorlet{EFD}{ofg}
\definecolor{codeborder}{HTML}{f0f0f0}

%% end customisations

\author{Shaurya Singh}
\date{\today}
\title{Texan Revolt Outline \#1\\\medskip
\large USH2}
\colorlet{greenyblue}{blue!70!green}
\colorlet{blueygreen}{blue!40!green}
\providecolor{link}{named}{greenyblue}
\providecolor{cite}{named}{blueygreen}
\hypersetup{
  pdfauthor={Shaurya Singh},
  pdftitle={Texan Revolt Outline \#1},
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 28.0.50 (Org mode 9.5)},
  pdflang={English},
  breaklinks=true,
  colorlinks=true,
  linkcolor=,
  urlcolor=link,
  citecolor=cite
}
\urlstyle{same}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents


\section{Start of the Texas Revolution}
\label{sec:org61327c8}
\subsection{The Texas Revolution began in June 1832}
\label{sec:org8ab406e}
\begin{enumerate}
\item Armed colonists freed William B. Travis and Patrick Jack
\item Were being held by COlonel Juan David Bradburn at the Anahuac
\item They Explained their actions
\end{enumerate}
\subsection{Turtle Bayou Resolutions}
\label{sec:org4a4109a}
\begin{enumerate}
\item the colonists claimed they had acted in support of a Federalist revolution
\item They claimed the revolution was being conducted in Mexico by Antonia Lopez de Santa Anna
\end{enumerate}
\section{Santa Anna’s revolution}
\label{sec:org855acfd}
\subsection{Santa Anna’s revolution had succeeded but he still embraced Centralism the following years}
\label{sec:org6683ae9}
\begin{enumerate}
\item Discarded Constitution of 1824 w/ its Federalist guarantees
\end{enumerate}
\begin{enumerate}
\item By 1835, several states within the Mexican Federation revolted against
the Centralist government.
\item In may of 1835. Santa Anna led his army to Zacatecas, where beat the state militia
\begin{enumerate}
\item Now he focused on texas
\end{enumerate}
\end{enumerate}
\section{Texas}
\label{sec:org848ef65}
\subsection{Mexican officials were concerned about the number of Anglo Colonists immigrating to Texas}
\label{sec:org6fa8292}
\begin{enumerate}
\item One solution was to increase the number of troops
\item General Martin Perfecto de Cos was sent to texas to keep dissidents in check
\item William B. Travis and his supporters had already confronted them at Anahuac.
\item Orders were issued for the arrest of Williams and his supporters
\item Flying a flag bearing the words “Come and Take it,” the colonists fired
back and and drove away the Mexicans
\end{enumerate}
\subsection{The colonists, realizing that war with the government had begun, moved to consolidate their hold on Texas.}
\label{sec:orgc0ae248}
\begin{enumerate}
\item On the night of October 9, 1835, the colonists seized Presidio La Bahía at Goliad and captured its garrison.
\item That month several hundred colonists gathered at Gonzales and formed
themselves into The Army of the People and elected Stephen F. Austin as
their commanding general.
\item By the end of October, the army was outside San Antonio de Béxar,
looking to gain control of that important political seat.
\end{enumerate}
\subsection{Inside the city was General Cos and his Centralist garrison.}
\label{sec:orgc0a313a}
\begin{enumerate}
\item Cos had landed at Copano and marched to Béxar just as the revolution was beginning.
\item The Texans laid siege to the city.
\item In late November Austin had to leave the army and travel to the United
States at the orders of the Provisional Government, andof the colonists
began to leave the army as well.
\item The situation did not look favorable for the Texans.
\begin{enumerate}
\item Rallies in support of the revolution had turned out recruits for the
fight against Mexico's Centralist government.
\item One group, headed by exiled Federalist leader General Méxia, landed
at Tampico but was defeated. Other volunteers, called the New
Orleans Greys, arrived at Béxar in time to bolster the Texan cause.
\end{enumerate}
\item On the morning of December 5, the Texans attacked the town, ultimately
forcing Cos and his garrison to surrender after several days of
fighting. By the end of 1835, no Centralist troops remained in Texas.
\end{enumerate}
\end{document}
